let questions = [
    {
        numb: 1,
        question: "'தமிழுக்கு அமுததனும் தெயர்' என்று கூறியவர் யார்?",
        answer: "b) பாரதிதாசன்",
        options: [
            "a) பாரதியார்",
            "b) பாரதிதாசன்",
            "c) வாணிதாசன்",
            "d) கண்ணதாசன்"
        ]
    },
    {
        numb: 2,
        question: "'தமிழ் எங்கள் அறிவுக்குத் தழல்' இங்கு 'தழல்' குறிக்கும்?",
        answer: "b) அறிவவப் பரப்புவது",
        options: [
            "a) ஒளி",
            "b) அறிவவப் பரப்புவது",
            "c) தீ",
            "d) சக்தி"
        ]
    },
    {
        numb: 3,
        question: "அதித்யா தனது கனவு எங்கு நிறைவேற்றுகிறார்?",
        answer: "a) ISRO",
        options: [
            "a) ISRO",
            "b) NASA",
            "c) DRDO",
            "d) HAL"
        ]
    },
    {
        numb: 4,
        question: "'அகர முதல எழுத்தெல்லாம் ஆதி பகவன் முதற்றே உலகு' – இந்தக் குறள் எண்?",
        answer: "a) 1",
        options: [
            "a) 1",
            "b) 10",
            "c) 100",
            "d) 133"
        ]
    },
    {
        numb: 5,
        question: "திருக்குறளில் மொத்த குறள் எண்ணிக்கை?",
        answer: "c) 1330",
        options: [
            "a) 1000",
            "b) 1200",
            "c) 1330",
            "d) 1500"
        ]
    },
    {
        numb: 6,
        question: "'சிலப்பதிகாரம்' என்னும் காவியம் எழுதியவர் யார்?",
        answer: "a) இளங்கோவடிகள்",
        options: [
            "a) இளங்கோவடிகள்",
            "b) திருவள்ளுவர்",
            "c) கம்பர்",
            "d) பாரதியார்"
        ]
    },
    {
        numb: 7,
        question: "திருக்குறள் எழுதியவர் யார்?",
        answer: "a) திருவள்ளுவர்",
        options: [
            "a) திருவள்ளுவர்",
            "b) பாரதி",
            "c) கம்பர்",
            "d) நக்கீரர்"
        ]
    },
    {
        numb: 8,
        question: "'அறிவியலால் ஆள்பவராம்' என்றது எதை குறிக்கும்?",
        answer: "b) அறிவியலின் ஆட்சி",
        options: [
            "a) தமிழின் அழகு",
            "b) அறிவியலின் ஆட்சி",
            "c) இயற்கைப் பாடல்",
            "d) பழமொழிகள்"
        ]
    },
    {
        numb: 9,
        question: "கிழவனும் கடலும் கதையின் இடம்?",
        answer: "b) கடற்கரை",
        options: [
            "a) பள்ளி",
            "b) கடற்கரை",
            "c) கிராமம்",
            "d) நிலம்"
        ]
    },
    {
        numb: 10,
        question: "தமிழில் மொத்த எழுத்துகள் எத்தனை?",
        answer: "c) 247",
        options: [
            "a) 12",
            "b) 18",
            "c) 247",
            "d) 216"
        ]
    },
    {
        numb: 11,
        question: "'அறம் தவழ்ந்த வளம் தரும்' குறிப்பு எங்கு உள்ளது?",
        answer: "b) வாழ்வின் ஒழுக்கம்",
        options: [
            "a) பழமொழி",
            "b) வாழ்வின் ஒழுக்கம்",
            "c) நாவல்",
            "d) உரையாடல்"
        ]
    },
    {
        numb: 12,
        question: "நூலகத்தில் பயன்படுத்தப்படும் கருவி?",
        answer: "a) கணிப்பொறி",
        options: [
            "a) கணிப்பொறி",
            "b) வீடியா கேம்ஸ்",
            "c) தொலைபேசி",
            "d) வாகனம்"
        ]
    },
    {
        numb: 13,
        question: "'மறம்' என்றால் என்ன?",
        answer: "c) வீரம்",
        options: [
            "a) ஒழுக்கம்",
            "b) கல்வி",
            "c) வீரம்",
            "d) சமாதானம்"
        ]
    },
    {
        numb: 14,
        question: "'ஒளி பிறந்தது' என்ற உரை எதை விளக்குகிறது?",
        answer: "c) மின்சாரம் பற்றிய அறிவியல் விளக்கம்",
        options: [
            "a) சூரியனைப் பற்றி",
            "b) மின்னலைப் பற்றி",
            "c) மின்சாரம் பற்றிய அறிவியல் விளக்கம்",
            "d) சூழ்நிலை"
        ]
    },
    {
        numb: 15,
        question: "வானியல் தெரிந்து கொள்ள பயன்படும் கருவி?",
        answer: "b) ரகசியவைக்கைகள்",
        options: [
            "a) வாரபத்திரிக்கை",
            "b) ரகசியவைக்கைகள்",
            "c) வானொலி",
            "d) இணையம்"
        ]
    },
    {
        numb: 16,
        question: "'கணியனின் நண்பன்' என்றால் யார்?",
        answer: "a) மாணவன்",
        options: [
            "a) மாணவன்",
            "b) ஆசிரியர்",
            "c) கணினி",
            "d) புத்தகம்"
        ]
    },
    {
        numb: 17,
        question: "வீரவிழாவில் தியாகத்தை எடுத்துரைத்தவர் யார்?",
        answer: "c) குயிலி",
        options: [
            "a) மீனா",
            "b) கண்ணி",
            "c) குயிலி",
            "d) குப்பனா"
        ]
    },
    {
        numb: 18,
        question: "'தமிழ் எங்கள் உயர்வுக்கு வான்' இங்கு 'வான்' குறிக்கும்?",
        answer: "b) உயர்வு",
        options: [
            "a) வானிலை",
            "b) உயர்வு",
            "c) ஒளி",
            "d) நிலா"
        ]
    },
    {
        numb: 19,
        question: "'வினைச்சொல்' இல்லாதது எது?",
        answer: "d) இதுவே மரம்",
        options: [
            "a) நான் சென்னை",
            "b) அவன் வாசித்தான்",
            "c) பூ மலர்ந்தது",
            "d) இதுவே மரம்"
        ]
    },
    {
        numb: 20,
        question: "தமிழில் உயிர்மெய் எழுத்துகள் எத்தனை?",
        answer: "c) 216",
        options: [
            "a) 12",
            "b) 18",
            "c) 216",
            "d) 247"
        ]
    },
    {
        numb: 21,
        question: "அறிவியல் ஆத்திசூடி வரிகள் எத்தனை?",
        answer: "c) 26",
        options: [
            "a) 50",
            "b) 108",
            "c) 26",
            "d) 33"
        ]
    },
    {
        numb: 22,
        question: "திருக்குறளில் வரும் முதல் பகுதி?",
        answer: "b) அறத்துப்பால்",
        options: [
            "a) பொருட்பால்",
            "b) அறத்துப்பால்",
            "c) காதற்பால்",
            "d) வாழ்வியல்"
        ]
    },
    {
        numb: 23,
        question: "கிழவனும் கடலும் – இதில் 'கிழவன்' யார்?",
        answer: "b) கடலோர வியாபாரி",
        options: [
            "a) விவசாயி",
            "b) கடலோர வியாபாரி",
            "c) ஆசிரியர்",
            "d) மாணவன்"
        ]
    },
    {
        numb: 24,
        question: "'முதல் எழுத்து' என்றால் என்ன?",
        answer: "a) உயிரெழுத்து",
        options: [
            "a) உயிரெழுத்து",
            "b) மெய்யெழுத்து",
            "c) பழமொழி",
            "d) பாயிர்ச்சி"
        ]
    },
    {
        numb: 25,
        question: "தமிழில் மெய்யெழுத்துகள் எத்தனை?",
        answer: "b) 18",
        options: [
            "a) 12",
            "b) 18",
            "c) 216",
            "d) 247"
        ]
    },
    {
        numb: 26,
        question: "'அறிவறம்' என்பது எதனால் உருவாகிறது?",
        answer: "b) அறிவு + அறம்",
        options: [
            "a) அறம் + உணவு",
            "b) அறிவு + அறம்",
            "c) அறம் + ஒழுக்கம்",
            "d) அறிவு + பாடம்"
        ]
    },
    {
        numb: 27,
        question: "'வான் தமிழின் தாய்மொழி' என்றால் என்ன?",
        answer: "b) பழமம் வாய்ந்த மொழி",
        options: [
            "a) அழகு தமிழ்",
            "b) பழமம் வாய்ந்த மொழி",
            "c) இலகு மொழி",
            "d) புதிய மொழி"
        ]
    },
    {
        numb: 28,
        question: "தமிழ் மொழியின் பரிணாமம் எத்தனை ஆண்டுகளுக்கு மேல்?",
        answer: "c) 2000 ஆண்டுகள்",
        options: [
            "a) 1000 ஆண்டுகள்",
            "b) 1500 ஆண்டுகள்",
            "c) 2000 ஆண்டுகள்",
            "d) 500 ஆண்டுகள்"
        ]
    },
    {
        numb: 29,
        question: "‘அதிகாரல்’ என்பது எந்த வகை சொல்?",
        answer: "a) பகுப்பாய்வு சொல்",
        options: [
            "a) பகுப்பாய்வு சொல்",
            "b) பெயர்ச்சொல்",
            "c) வினைச்சொல்",
            "d) உரிச்சொல்"
        ]
    },
    {
        numb: 30,
        question: "'காமராஜருக்கு வழங்கப்பட்ட பட்டம் எது?'",
        answer: "b) கல்விக்கண் திறந்தவர்",
        options: [
            "a) கல்விப்பண்பாட்டாளர்",
            "b) கல்விக்கண் திறந்தவர்",
            "c) கல்வி தலைவர்",
            "d) புத்தகவாணர்"
        ]
    }
];
